# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 02 - Pandas - Criando Dataframes

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/



## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

# Pandas - Criando Dataframes

## Pandas

O pandas é uma ferramenta de análise e manipulação de dados de código aberto rápida, poderosa, flexível e fácil de usar,
construída sobre a linguagem de programação Python 

https://pandas.pydata.org/

## Estruturas de dados do Pandas

In [1]:
import numpy as np
import pandas as pd

## DataFrame 
- DataFrame é uma estrutura de dados rotulada bidimensional com colunas de tipos potencialmente diferentes. 
- Objeto pandas é o mais comumente usado.
- Aceita muitos tipos diferentes de entrada na sua criação: Dict de 1D ndarrays, listas, dicts ou Series, 2-D numpy.ndarray, Outro DataFrame.
- Opcionalmente pode receber como argumentos de índice (rótulos de linha) e colunas (rótulos de coluna). 
- Se não passar rótulos serão gerados automaticamente.


### Criando dataframe a partir de dict de Série ou dicts 
- O índice resultante será a união dos índices das várias Séries.
- Se houver dicts aninhados, eles serão primeiro convertidos em Series. 
- Se nenhuma coluna for passada, as colunas serão a lista ordenada de chaves de dicionário.

In [2]:
d = {'col1': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'col2': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
print(d)
df = pd.DataFrame(d)
print (df.index )
print (df.columns)
df

{'col1': a    1.0
b    2.0
c    3.0
dtype: float64, 'col2': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}
Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['col1', 'col2'], dtype='object')

   col1  col2
a   1.0   1.0
b   2.0   2.0
c   3.0   3.0
d   NaN   4.0

In [3]:
d = {'col1': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'col2': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
print(d)
df = pd.DataFrame(d, index=['d', 'b', 'a'])
print (df.index )
print (df.columns)
df

{'col1': a    1.0
b    2.0
c    3.0
dtype: float64, 'col2': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}
Index(['d', 'b', 'a'], dtype='object')
Index(['col1', 'col2'], dtype='object')

   col1  col2
d   NaN   4.0
b   2.0   2.0
a   1.0   1.0

In [4]:
d = {'col1': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'col2': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
print(d)
df = pd.DataFrame(d, index=['d', 'b', 'a'], columns=['col1', 'col2'])
print (df.index )
print (df.columns)
df

{'col1': a    1.0
b    2.0
c    3.0
dtype: float64, 'col2': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}
Index(['d', 'b', 'a'], dtype='object')
Index(['col1', 'col2'], dtype='object')

   col1  col2
d   NaN   4.0
b   2.0   2.0
a   1.0   1.0

In [5]:

d = {'col1': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'col2': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
print(d)
df = pd.DataFrame(d, index=['d', 'b', 'a', 'm'], columns=['col1', 'col3'])
print (df.index )
print (df.columns)
df

{'col1': a    1.0
b    2.0
c    3.0
dtype: float64, 'col2': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}
Index(['d', 'b', 'a', 'm'], dtype='object')
Index(['col1', 'col3'], dtype='object')

   col1 col3
d   NaN  NaN
b   2.0  NaN
a   1.0  NaN
m   NaN  NaN

In [6]:
dados = {'percentualcomissao' : pd.Series([.05, .05, .5], index=['João','Alexandre','Willian']),
          'vendas' : pd.Series([100, 200, 300], index=['Willian','João','Alexandre']) }

In [7]:
dfcomissoes = pd.DataFrame(dados)
dfcomissoes

           percentualcomissao  vendas
Alexandre                0.05     300
João                     0.05     200
Willian                  0.50     100

In [8]:
dfcomissoes['Comissao'] = dfcomissoes['percentualcomissao']  * dfcomissoes['vendas']
dfcomissoes

           percentualcomissao  vendas  Comissao
Alexandre                0.05     300      15.0
João                     0.05     200      10.0
Willian                  0.50     100      50.0

### Criando dataframe a partir de dict de ndarrays / listas 
- Os ndarrays / listas devem ter todos o mesmo comprimento. 
- Se um índice for passado, ele deve ter o mesmo comprimento dos arrays. 
- Se nenhum índice for passado, o resultado será range(n), onde né o comprimento do array.

In [9]:
d = {'col1': [1., 2., 3., 4.],
'col2': [4., 3., 2., 1.]}

df = pd.DataFrame(d)

print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=4, step=1)
Index(['col1', 'col2'], dtype='object')

   col1  col2
0   1.0   4.0
1   2.0   3.0
2   3.0   2.0
3   4.0   1.0

In [10]:
d = {'col1': [1., 2., 3., 4.],
'col2': [4., 3., 2., 1.]}

df = pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

print (df.index )
print (df.columns)
df

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['col1', 'col2'], dtype='object')

   col1  col2
a   1.0   4.0
b   2.0   3.0
c   3.0   2.0
d   4.0   1.0

### Criando dataframe a partir de matriz estruturada ou de registro 
- Similar ao procedimento com dicionário de matrizes.
- O DataFrame tem simnilaridades, mas não foi projetado para funcionar exatamente como um ndarray NumPy bidimensional

In [11]:
data = np.zeros((2, ), dtype=[('col1', 'i4'), ('col2', 'f4'), ('col3', 'U10')])
data[:] = [(1, 2., 'João'), (2, 3., "Sebastião")]
data

array([(1, 2., 'João'), (2, 3., 'Sebastião')],
      dtype=[('col1', '<i4'), ('col2', '<f4'), ('col3', '<U10')])

In [12]:
df = pd.DataFrame(data)

print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=2, step=1)
Index(['col1', 'col2', 'col3'], dtype='object')

   col1  col2       col3
0     1   2.0       João
1     2   3.0  Sebastião

In [13]:
df = pd.DataFrame(data, index=['a', 'b'])
print (df.index )
print (df.columns)
df

Index(['a', 'b'], dtype='object')
Index(['col1', 'col2', 'col3'], dtype='object')

   col1  col2       col3
a     1   2.0       João
b     2   3.0  Sebastião

In [14]:
df = pd.DataFrame(data, columns=['col1' , 'col2', 'col3'])
print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=2, step=1)
Index(['col1', 'col2', 'col3'], dtype='object')

   col1  col2       col3
0     1   2.0       João
1     2   3.0  Sebastião

In [15]:
df = pd.DataFrame(data, columns=['col1' , 'col2', 'col4'])
print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=2, step=1)
Index(['col1', 'col2', 'col4'], dtype='object')

   col1  col2 col4
0     1   2.0  NaN
1     2   3.0  NaN

### Criando dataframe a partir de uma lista de dicts

In [16]:
data2 = [{'col1': 1, 'col2': 2}, 
         {'col1': 5, 'col2': 10, 'col3': 20}]
df = pd.DataFrame(data2)
print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=2, step=1)
Index(['col1', 'col2', 'col3'], dtype='object')

   col1  col2  col3
0     1     2   NaN
1     5    10  20.0

In [17]:
data2 = [{'col1': 1, 'col2': 2}, 
         {'col1': 5, 'col2': 10, 'col3': 20}]
df = pd.DataFrame(data2, index=[3, 4])
print (df.index )
print (df.columns)
df

Int64Index([3, 4], dtype='int64')
Index(['col1', 'col2', 'col3'], dtype='object')

   col1  col2  col3
3     1     2   NaN
4     5    10  20.0

In [18]:
data2 = [{'col1': 1, 'col2': 2}, 
         {'col1': 5, 'col2': 10, 'col3': 20}]
df = pd.DataFrame(data2, columns=['col1' , 'col2', 'col4'])
print (df.index )
print (df.columns)
df

RangeIndex(start=0, stop=2, step=1)
Index(['col1', 'col2', 'col4'], dtype='object')

   col1  col2  col4
0     1     2   NaN
1     5    10   NaN

In [19]:
estadoslista = [{"id":11,"sigla":"RO","nome":"Rondônia","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":12,"sigla":"AC","nome":"Acre","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":13,"sigla":"AM","nome":"Amazonas","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":14,"sigla":"RR","nome":"Roraima","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":15,"sigla":"PA","nome":"Pará","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":16,"sigla":"AP","nome":"Amapá","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":17,"sigla":"TO","nome":"Tocantins","regiao":{"id":1,"sigla":"N","nome":"Norte"}},{"id":21,"sigla":"MA","nome":"Maranhão","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":22,"sigla":"PI","nome":"Piauí","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":23,"sigla":"CE","nome":"Ceará","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":24,"sigla":"RN","nome":"Rio Grande do Norte","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":25,"sigla":"PB","nome":"Paraíba","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":26,"sigla":"PE","nome":"Pernambuco","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":27,"sigla":"AL","nome":"Alagoas","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":28,"sigla":"SE","nome":"Sergipe","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":29,"sigla":"BA","nome":"Bahia","regiao":{"id":2,"sigla":"NE","nome":"Nordeste"}},{"id":31,"sigla":"MG","nome":"Minas Gerais","regiao":{"id":3,"sigla":"SE","nome":"Sudeste"}},{"id":32,"sigla":"ES","nome":"Espírito Santo","regiao":{"id":3,"sigla":"SE","nome":"Sudeste"}},{"id":33,"sigla":"RJ","nome":"Rio de Janeiro","regiao":{"id":3,"sigla":"SE","nome":"Sudeste"}},{"id":35,"sigla":"SP","nome":"São Paulo","regiao":{"id":3,"sigla":"SE","nome":"Sudeste"}},{"id":41,"sigla":"PR","nome":"Paraná","regiao":{"id":4,"sigla":"S","nome":"Sul"}},{"id":42,"sigla":"SC","nome":"Santa Catarina","regiao":{"id":4,"sigla":"S","nome":"Sul"}},{"id":43,"sigla":"RS","nome":"Rio Grande do Sul","regiao":{"id":4,"sigla":"S","nome":"Sul"}},{"id":50,"sigla":"MS","nome":"Mato Grosso do Sul","regiao":{"id":5,"sigla":"CO","nome":"Centro-Oeste"}},{"id":51,"sigla":"MT","nome":"Mato Grosso","regiao":{"id":5,"sigla":"CO","nome":"Centro-Oeste"}},{"id":52,"sigla":"GO","nome":"Goiás","regiao":{"id":5,"sigla":"CO","nome":"Centro-Oeste"}},{"id":53,"sigla":"DF","nome":"Distrito Federal","regiao":{"id":5,"sigla":"CO","nome":"Centro-Oeste"}}]

In [20]:
dfestados = pd.DataFrame(estadoslista)
dfestados

,id,sigla,nome,regiao
0,11,RO,Rondônia,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
1,12,AC,Acre,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
2,13,AM,Amazonas,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
3,14,RR,Roraima,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
4,15,PA,Pará,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
5,16,AP,Amapá,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
6,17,TO,Tocantins,"{'id': 1, 'sigla': 'N', 'nome': 'Norte'}"
7,21,MA,Maranhão,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
8,22,PI,Piauí,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
9,23,CE,Ceará,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
10,24,RN,Rio Grande do Norte,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
11,25,PB,Paraíba,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
12,26,PE,Pernambuco,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
13,27,AL,Alagoas,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
14,28,SE,Sergipe,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
15,29,BA,Bahia,"{'id': 2, 'sigla': 'NE', 'nome': 'Nordeste'}"
16,31,MG,Minas Gerais,"{'id': 3, 'sigla': 'SE', 'nome': 'Sudeste'}"
17,32,ES,Espírito Santo,"{'id': 3, 'sigla': 'SE', 'nome': 'Sudeste'}"
18,33,RJ,Rio de Janeiro,"{'id': 3, 'sigla': 'SE', 'nome': 'Sudeste'}"
19,35,SP,São Paulo,"{'id': 3, 'sigla': 'SE', 'nome': 'Sudeste'}"
20,41,PR,Paraná,"{'id': 4, 'sigla': 'S', 'nome': 'Sul'}"
21,42,SC,Santa Catarina,"{'id': 4, 'sigla': 'S', 'nome': 'Sul'}"
22,43,RS,Rio Grande do Sul,"{'id': 4, 'sigla': 'S', 'nome': 'Sul'}"
23,50,MS,Mato Grosso do Sul,"{'id': 5, 'sigla': 'CO', 'nome': 'Centro-Oeste'}"
24,51,MT,Mato Grosso,"{'id': 5, 'sigla': 'CO', 'nome': 'Centro-Oeste'}"
25,52,GO,Goiás,"{'id': 5, 'sigla': 'CO', 'nome': 'Centro-Oeste'}"
26,53,DF,Distrito Federal,"{'id': 5, 'sigla': 'CO', 'nome': 'Centro-Oeste'}"

In [21]:
dfestados = pd.DataFrame(estadoslista, columns=['sigla', 'nome'])
dfestados

   sigla                 nome
0     RO             Rondônia
1     AC                 Acre
2     AM             Amazonas
3     RR              Roraima
4     PA                 Pará
5     AP                Amapá
6     TO            Tocantins
7     MA             Maranhão
8     PI                Piauí
9     CE                Ceará
10    RN  Rio Grande do Norte
11    PB              Paraíba
12    PE           Pernambuco
13    AL              Alagoas
14    SE              Sergipe
15    BA                Bahia
16    MG         Minas Gerais
17    ES       Espírito Santo
18    RJ       Rio de Janeiro
19    SP            São Paulo
20    PR               Paraná
21    SC       Santa Catarina
22    RS    Rio Grande do Sul
23    MS   Mato Grosso do Sul
24    MT          Mato Grosso
25    GO                Goiás
26    DF     Distrito Federal

### Criando dataframe a partir de um dicionário de tuplas 
Pode-se criar automaticamente um dataframe Multindexado passando um dicionário de tuplas.

In [22]:
import pandas as pd
df = pd.DataFrame({
        ('1BIM', 'JAN'): {
                    ('SE', 'São Paulo'): 45645, 
                    ('SE', 'Rio de Janeiro'): 4564, 
                    ('CO', 'Goiás'): 4564, 
                    ('CO', 'Mato Grosso'): 4564,        
                    },
        ('1BIM', 'FEV'): {
                    ('SE', 'São Paulo'): 45645, 
                    ('SE', 'Rio de Janeiro'): 4564, 
                    ('CO', 'Goiás'): 456456, 
                    ('CO', 'Mato Grosso'): 45645,       
                    },
        ('2BIM', 'MAR'): {
                    ('SE', 'São Paulo'): 4564, 
                    ('SE', 'Rio de Janeiro'): 456, 
                    ('CO', 'Goiás'): 45645, 
                    ('CO', 'Mato Grosso'): 3345,       
                    },
        ('2BIM', 'ABR'): {
                    ('SE', 'São Paulo'): 123132, 
                    ('SE', 'Rio de Janeiro'): 123123, 
                    ('CO', 'Goiás'): 12312, 
                    ('CO', 'Mato Grosso'): 1123,       
                    },
        })
print (df.index )
print (df.columns)
df

MultiIndex([('SE',      'São Paulo'),
            ('SE', 'Rio de Janeiro'),
            ('CO',          'Goiás'),
            ('CO',    'Mato Grosso')],
           )
MultiIndex([('1BIM', 'JAN'),
            ('1BIM', 'FEV'),
            ('2BIM', 'MAR'),
            ('2BIM', 'ABR')],
           )

                    1BIM           2BIM
                     JAN     FEV    MAR     ABR
SE São Paulo       45645   45645   4564  123132
   Rio de Janeiro   4564    4564    456  123123
CO Goiás            4564  456456  45645   12312
   Mato Grosso      4564   45645   3345    1123

In [23]:
df['1BIM']

                     JAN     FEV
SE São Paulo       45645   45645
   Rio de Janeiro   4564    4564
CO Goiás            4564  456456
   Mato Grosso      4564   45645

In [24]:
df['1BIM']['JAN']

SE  São Paulo         45645
    Rio de Janeiro     4564
CO  Goiás              4564
    Mato Grosso        4564
Name: JAN, dtype: int64

In [25]:
df['1BIM']['JAN']['SE']

São Paulo         45645
Rio de Janeiro     4564
Name: JAN, dtype: int64

In [26]:
df['1BIM']['JAN']['SE']['São Paulo']

45645

### Criando Dataframe a partir uma série
- O resultado será um DataFrame com o mesmo índice da série de entrada e com uma coluna cujo nome é o nome original da série (somente se nenhum outro nome de coluna for fornecido).

In [27]:
import string
data = [x for x in string.ascii_lowercase]
index = list(range(0,len(data)))

dict1 =  { x : y for x, y in zip(index,data)}
print(dict1)

s = pd.Series(dict1)


s.name = 'coluna 01'
print(s)

{0: 'a', 1: 'b', 2: 'c', 3: 'd', 4: 'e', 5: 'f', 6: 'g', 7: 'h', 8: 'i', 9: 'j', 10: 'k', 11: 'l', 12: 'm', 13: 'n', 14: 'o', 15: 'p', 16: 'q', 17: 'r', 18: 's', 19: 't', 20: 'u', 21: 'v', 22: 'w', 23: 'x', 24: 'y', 25: 'z'}
0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: coluna 01, dtype: object

In [28]:
import pandas as pd
df = pd.DataFrame(s)

print (df.index )
print (df.columns)
df

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25],
           dtype='int64')
Index(['coluna 01'], dtype='object')

   coluna 01
0          a
1          b
2          c
3          d
4          e
5          f
6          g
7          h
8          i
9          j
10         k
11         l
12         m
13         n
14         o
15         p
16         q
17         r
18         s
19         t
20         u
21         v
22         w
23         x
24         y
25         z

## Criando a partir de dicionários usando DataFrame.from_dict

DataFrame.from_dict utiliza um dict de dicts ou um dict de sequências do tipo array e retorna um DataFrame.

In [29]:
df =  pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]))
df

   A  B
0  1  4
1  2  5
2  3  6

Se você passar orient='index', as chaves serão os rótulos das linhas. Nesse caso, você também pode passar os nomes das colunas desejadas:

In [30]:
df = pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]),
                    orient='index', columns=['primeiro', 'segundo', 'terceiro'])
df

   primeiro  segundo  terceiro
A         1        2         3
B         4        5         6

In [31]:
df['quatro'] = df['primeiro'] * df['segundo']

In [32]:
df['flag'] = df['primeiro'] > 2

In [33]:
df

   primeiro  segundo  terceiro  quatro   flag
A         1        2         3       2  False
B         4        5         6      20   True

As colunas podem ser excluídas ou pop-pop como com um dicionario:

In [34]:
del df['segundo']
df

   primeiro  terceiro  quatro   flag
A         1         3       2  False
B         4         6      20   True

In [35]:
col1 = df.pop('primeiro')
df

   terceiro  quatro   flag
A         3       2  False
B         6      20   True

In [36]:
col1

A    1
B    4
Name: primeiro, dtype: int64

Ao inserir um valor escalar, ele será naturalmente propagado para preencher a coluna:

In [37]:
df['quatro'] = 4
df

   terceiro  quatro   flag
A         3       4  False
B         6       4   True

Ao inserir uma Série que não possui o mesmo índice do DataFrame, ela será conformada ao índice do DataFrame:

In [38]:
df['terceiro']['B']

6

In [39]:
df['quinta'] = pd.Series([3,4] ,index=['B','C'])
df

   terceiro  quatro   flag  quinta
A         3       4  False     NaN
B         6       4   True     3.0

Você pode inserir ndarrays brutos, mas seu comprimento deve corresponder ao comprimento do índice do DataFrame.

In [40]:
import numpy as np
df['arr'] = np.array([5,6])
df

   terceiro  quatro   flag  quinta  arr
A         3       4  False     NaN    5
B         6       4   True     3.0    6

In [41]:
df.at['A', 'quatro'] = 8
df

   terceiro  quatro   flag  quinta  arr
A         3       8  False     NaN    5
B         6       4   True     3.0    6

In [42]:
df.at['A', 'quatro'] = 8
df

   terceiro  quatro   flag  quinta  arr
A         3       8  False     NaN    5
B         6       4   True     3.0    6

Por padrão, as colunas são inseridas no final. A insertfunção está disponível para inserir em um local específico nas colunas:

In [43]:
df.insert(1, 'copia1', df['terceiro'])
df

   terceiro  copia1  quatro   flag  quinta  arr
A         3       3       8  False     NaN    5
B         6       6       4   True     3.0    6

Atribuindo novas colunas em cadeias de métodos 
Inspirado no mutate verbo de dplyr, DataFrame tem um método assign()  que permite criar facilmente novas colunas que são potencialmente derivadas de colunas existentes.

In [48]:
estados = pd.read_csv('./content/totaisestados_arr.csv', sep=';',names =['UF','CASOS','OBITOS'])
estados.head()

   UF   CASOS  OBITOS
0  DF  221526    3845
1  GO  269857    6107
2  MS   89654    1699
3  MT  152968    4009
4  AL   92951    2304

In [49]:
estados['taxaletalidade'] = estados['OBITOS'] / estados['CASOS']  * 100
estados

    UF    CASOS  OBITOS  taxaletalidade
0   DF   221526    3845        1.735688
1   GO   269857    6107        2.263050
2   MS    89654    1699        1.895063
3   MT   152968    4009        2.620810
4   AL    92951    2304        2.478725
5   BA   377445    8013        2.122958
6   CE   288122    9461        3.283678
7   MA   190321    4203        2.208374
8   PB   140355    3223        2.296320
9   PE   172716    8873        5.137335
10  PI   120913    2554        2.112263
11  RN    84381    2649        3.139332
12  SE    86361    2266        2.623870
13  AC    33725     709        2.102298
14  AM   171161    4728        2.762312
15  AP    55652     783        1.406958
16  PA   263155    6844        2.600749
17  RO    76019    1511        1.987661
18  RR    61001     709        1.162276
19  TO    78618    1144        1.455138
20  ES   174144    4058        2.330255
21  MG   387751    9605        2.477105
22  RJ   332396   21698        6.527756
23  SP  1184496   40927        3.455225
24  PR   246169    5793        2.353261
25  RS   287204    6356        2.213061
26  SC   306788    3384        1.103042

In [50]:
estados = estados.assign(taxaletalidade= estados['OBITOS'] / estados['CASOS']*100)
estados.head()

   UF   CASOS  OBITOS  taxaletalidade
0  DF  221526    3845        1.735688
1  GO  269857    6107        2.263050
2  MS   89654    1699        1.895063
3  MT  152968    4009        2.620810
4  AL   92951    2304        2.478725

No exemplo acima, inserimos um valor pré-calculado. Também podemos passar uma função de um argumento a ser avaliado no DataFrame que está sendo atribuído.

In [51]:
estados =  estados.assign(
    taxaletalidade=lambda x: (x['OBITOS'] / x['CASOS']*100),
    obtitosmil = lambda x : x['OBITOS']/1000,
    casosmil =  lambda x : x['CASOS']/1000,
    )

estados.head()

   UF   CASOS  OBITOS  taxaletalidade  obtitosmil  casosmil
0  DF  221526    3845        1.735688       3.845   221.526
1  GO  269857    6107        2.263050       6.107   269.857
2  MS   89654    1699        1.895063       1.699    89.654
3  MT  152968    4009        2.620810       4.009   152.968
4  AL   92951    2304        2.478725       2.304    92.951

## Leituras Adicionais e Referências:

- Python Tutorial at W3Schools: https://www.w3schools.com/python/
- Python official documentation: https://docs.python.org/3/tutorial/index.html
- Pandas  official documentation: https://pandas.pydata.org/pandas-docs/stable/index.html